* Converter

  Converts the previous bison style grammar to javacc grammar:

  #+BEGIN_SRC elisp :var grammar = ll1-grammar
    (defun rule-productions (rules)
      (setq case-fold-search nil)
      (replace-regexp-in-string
       "\\(\\`\\s-*\\|\\s-*\\'\\)" ""
       (replace-regexp-in-string
        "\\_<\\([a-z_]+\\)\\_>" "\\1()"
        (replace-regexp-in-string
         "\\_<\\(t[A-Z_]+\\)\\_>" "<\\1>"
         (replace-regexp-in-string
          "\\`\\s-*\\'" "{}"
          (replace-regexp-in-string
           "\\`\\s-*|\\(.*\\)" "\\1 | {}"
           (replace-regexp-in-string
            "|\\s-*\\'" "| {}"
            (replace-regexp-in-string
             "\\(.*\\)|\\s-*|\\(.*\\)" "\\1|\\2| {}"
             (replace-regexp-in-string
              "'" "_" rules)))))))))

    (defun rule (rule)
      (string-match "\\(?:\\s-\\|^\\)\\(\\(?:\\w\\|_\\)+\\).*:\\(.*\\)" rule)
      (setq rule-name (subst-char-in-string ?' ?_ (match-string 1 rule)))
      (format "void %s() :\n{\n}\n\n{\n  %s\n}\n"
              rule-name
              (rule-productions (match-string 2 rule))))

    (defun to-javacc (input)
      (setq case-fold-search nil)
      (setq input (replace-regexp-in-string "%%\\(\\(?:.\\|\n\\)*\\)%%" "\\1" input))
      (setq pos 0)
      (setq javacc-text "")
      (while (string-match "\\(.+:.*\\);\n" input pos)
        (setq pos (match-end 0))
        (setq javacc-text (concat javacc-text "\n" (rule (match-string 1 input))))
        )
      javacc-text)

    (to-javacc grammar)
  #+END_SRC

  #+RESULTS:
  #+begin_example

    void programa() :
    {
    }

    {
      <tPROGRAMA> <tID> <tPUNTOCOMA> declaracion_variables() declaracion_acciones() bloque_sentencias()
    }

    void declaracion_variables() :
    {
    }

    {
      declaracion() <tPUNTOCOMA> declaracion_variables() | {}
    }

    void declaracion() :
    {
    }

    {
      tipo_variables() identificadores()
    }

    void tipo_variables() :
    {
    }

    {
      <tENTERO> | <tCARACTER> | <tBOOLEANO>
    }

    void identificadores() :
    {
    }

    {
      <tID> repeticion_identificadores()
    }

    void repeticion_identificadores() :
    {
    }

    {
      <tCOMA> <tID> repeticion_identificadores() | {}
    }

    void declaracion_acciones() :
    {
    }

    {
      declaracion_accion() declaracion_acciones() | {}
    }

    void declaracion_accion() :
    {
    }

    {
      cabecera_accion() <tPUNTOCOMA> declaracion_variables() declaracion_acciones() bloque_sentencias()
    }

    void cabecera_accion() :
    {
    }

    {
      <tACCION> <tID> parametros_formales()
    }

    void parametros_formales() :
    {
    }

    {
      <tPAR_IZQ> lista_parametros() <tPAR_DCHA> | {}
    }

    void lista_parametros() :
    {
    }

    {
      parametro() repeticion_parametro() | {}
    }

    void parametro() :
    {
    }

    {
      clase_parametros() tipo_variables() identificadores()
    }

    void repeticion_parametro() :
    {
    }

    {
      <tPUNTOCOMA> parametro() repeticion_parametro() | {}
    }

    void clase_parametros() :
    {
    }

    {
      <tVAL> | <tREF>
    }

    void bloque_sentencias() :
    {
    }

    {
      <tPRINCIPIO> lista_sentencias() <tFIN>
    }

    void lista_sentencias() :
    {
    }

    {
      sentencia() repeticion_lista_sentencias()
    }

    void repeticion_lista_sentencias() :
    {
    }

    {
      sentencia() repeticion_lista_sentencias() | {}
    }

    void sentencia() :
    {
    }

    {
      leer() <tPUNTOCOMA> | escribir() <tPUNTOCOMA> | asignacion_invocacion() | seleccion() | mientras_que() | <tPUNTOCOMA>
    }

    void leer() :
    {
    }

    {
      <tLEER> <tPAR_IZQ> identificadores() <tPAR_DCHA>
    }

    void escribir() :
    {
    }

    {
      <tESCRIBIR> <tPAR_IZQ> lista_argumentos_escribir() <tPAR_DCHA>
    }

    void asignacion_invocacion() :
    {
    }

    {
      <tID> asignacion_invocacion_()
    }

    void asignacion_invocacion_() :
    {
    }

    {
      asignacion() | invocacion_accion()
    }

    void asignacion() :
    {
    }

    {
      <tOPAS> expresion_bool() <tPUNTOCOMA>
    }

    void invocacion_accion() :
    {
    }

    {
      argumentos_accion() <tPUNTOCOMA>
    }

    void mientras_que() :
    {
    }

    {
      <tMQ> expresion_bool() lista_sentencias() <tFMQ>
    }

    void seleccion() :
    {
    }

    {
      <tSI> seleccion_()
    }

    void argumentos_accion() :
    {
    }

    {
      <tPAR_IZQ> lista_argumentos_vacia() <tPAR_DCHA> | {}
    }

    void argumento_escribir() :
    {
    }

    {
      <tKCADENA> | expresion_bool()
    }

    void lista_argumentos_vacia() :
    {
    }

    {
      expresion_bool() repeticion_argumentos() | {}
    }

    void lista_argumentos_no_vacia() :
    {
    }

    {
      expresion_bool() repeticion_argumentos()
    }

    void lista_argumentos_escribir() :
    {
    }

    {
      <tKCADENA> repeticion_argumentos() | expresion_bool() repeticion_argumentos()
    }

    void repeticion_argumentos() :
    {
    }

    {
      <tCOMA> expresion_bool() repeticion_argumentos() | {}
    }

    void repeticion_argumentos_escribir() :
    {
    }

    {
      <tCOMA> argumento_escribir() repeticion_argumentos_escribir()
    }

    void operador_relacional() :
    {
    }

    {
      <tMAYOR> | <tMENOR> | <tIGUAL> | <tMAI> | <tMEI> | <tNI>
    }

    void caraent() :
    {
    }

    {
      <tCARAENT> caraent_()
    }

    void entacar() :
    {
    }

    {
      <tENTACAR> <tPAR_IZQ> expresion_bool() <tPAR_DCHA>
    }

    void expresion_bool() :
    {
    }

    {
      term_bool() expresion_bool_()
    }

    void term_bool() :
    {
    }

    {
      factor_bool_unario() term_bool_()
    }

    void factor_bool_unario() :
    {
    }

    {
      <tNOT> factor_bool() | factor_bool()
    }

    void factor_bool() :
    {
    }

    {
      <tFALSE> | <tTRUE> | relacion()
    }

    void relacion() :
    {
    }

    {
      expresion_arit() relacion_()
    }

    void expresion_arit() :
    {
    }

    {
      term_arit() expresion_arit_()
    }

    void term_arit() :
    {
    }

    {
      factor_arit_unario() term_arit_()
    }

    void factor_arit_unario() :
    {
    }

    {
      <tMAS> factor_arit() | <tMENOS> factor_arit() | factor_arit()
    }

    void factor_arit() :
    {
    }

    {
      <tKENTERO> | <tID> | <tKCARACTER> | <tPAR_IZQ> expresion_bool() <tPAR_DCHA> | entacar() | <tCARAENT> factor_arit_()
    }

    void expresion_bool_() :
    {
    }

    {
      <tOR> term_bool() expresion_bool_() | {}
    }

    void term_bool_() :
    {
    }

    {
      <tAND> factor_bool_unario() term_bool_() | {}
    }

    void expresion_arit_() :
    {
    }

    {
      <tMAS> term_arit() expresion_arit_() | <tMENOS> term_arit() expresion_arit_() | {}
    }

    void term_arit_() :
    {
    }

    {
      <tMUL> factor_arit_unario() term_arit_() | <tDIV> factor_arit_unario() term_arit_() | <tDIVCHAR> factor_arit_unario() term_arit_() | <tMOD> factor_arit_unario() term_arit_() | {}
    }

    void seleccion_() :
    {
    }

    {
      expresion_bool() seleccion__()
    }

    void caraent_() :
    {
    }

    {
      <tPAR_IZQ> caraent__()
    }

    void relacion_() :
    {
    }

    {
      operador_relacional() expresion_arit() | {}
    }

    void factor_arit_() :
    {
    }

    {
      <tPAR_IZQ> factor_arit__()
    }

    void seleccion__() :
    {
    }

    {
      <tENT> seleccion___()
    }

    void caraent__() :
    {
    }

    {
      <tKCARACTER> <tPAR_DCHA> | entacar() <tPAR_DCHA> | <tID> <tPAR_DCHA>
    }

    void factor_arit__() :
    {
    }

    {
      <tKCARACTER> <tPAR_DCHA> | entacar() <tPAR_DCHA> | <tID> <tPAR_DCHA>
    }

    void seleccion___() :
    {
    }

    {
      lista_sentencias() seleccion____()
    }

    void seleccion____() :
    {
    }

    {
      <tFSI> | <tSI_NO> lista_sentencias() <tFSI>
    }
  #+end_example
